ci4_paranomi/app/Controllers/DashboardController.php

SELECT *
FROM `users`
WHERE `users`.`id` = 4
---
    public function index()
    {
        $authHeader = $this->request->getHeaderLine('Authorization');

        if (!$authHeader || !preg_match('/Bearer\s(\S+)/', $authHeader, $matches)) {
            return $this->failUnauthorized('Yetkilendirme hatası! JWT eksik.');
        }

        try {
            $decoded = JWT::decode($matches[1], new Key($this->secretKey, 'HS256'));
        } catch (\Exception $e) {
            return $this->failUnauthorized('Geçersiz token!');
        }

        $userModel = new User();
        $user = $userModel->find($decoded->id);